




# # 리스트를 생성하는법!
# empty_list1 = []
# empty_list2 = list()

# # 초기 데이터를 아는경우
# # numbers = [1, 2, 3, 4, 5]
# mixed = [1, "Hello", 3.14, True] # 파이썬에서는 데이터를 혼용가능하다

# # 다른 군집 자료형들
# tuple = (1, 2, 3)
# dictionary = {'a':1, 'b':3}


# # 인덱스
# # 자료의 순서!
# # 주의! 0부터 시작함
# # 인덱스 값이 자료의 길이보다 크면?
# # 오류가 납니다
# # -인덱스 값은 뒤에서부터 다시 자료를 찾습니다


# # 슬라이싱
# # 자르는거
# numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8]
# # 2, 3, 4 만 잘라내려면?
# print(numbers[2:5])
# print(numbers[:5])
# print(numbers[2:])
# print(numbers[::2])

# fruits = ['사과', '바나나', '오렌지', '체리']
# # 사과 바나나만 슬라이스!
# print(fruits[:2])


#0 = 빈공간


# 리스트 연장하기
fruits = ['사과', '바나나', '오렌지', '체리']














































